app/controllers/api/users_controller.rb

  def show
    respond_with User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("fb_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["fb_id", "1123123FFSFD3434334r3ASDASDASDASDSD"], ["created_at", "2016-04-20 23:07:52.506220"], ["updated_at", "2016-04-20 23:07:52.506220"]]